       IDENTIFICATION DIVISION.
       PROGRAM-ID. echec.
       AUTHOR. Thomas Baudrin.

       DATA DIVISION.
       
       WORKING-STORAGE SECTION.
       
       
       